# Sesi 6

EDA with Pandas

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv')

In [5]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [6]:
df['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [7]:
df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [8]:
df['NUM_BEDROOMS']

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7     --
8     na
Name: NUM_BEDROOMS, dtype: object

In [9]:
df['NUM_BEDROOMS'].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [10]:
missing_values = ['n/a', 'na', '--']

In [11]:
df = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/property_data.csv', na_values=missing_values)

In [12]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [13]:
cnt = 0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1

In [14]:
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN  LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0   BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0        2  1600.0

In [15]:
df.isnull().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    4
NUM_BATH        1
SQ_FT           2
dtype: int64

In [16]:
df.isnull().values.any()

True

In [17]:
df.isnull().sum().sum()

12

In [18]:
df['ST_NUM'].fillna(125, inplace=True)

In [19]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0   125.0   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0   125.0  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [20]:
df.loc[4, 'ST_NUM'] = 130

In [21]:
median = df['NUM_BEDROOMS'].median()

In [22]:
df['NUM_BEDROOMS'].fillna(median, inplace=True)

In [23]:
data = pd.ExcelFile('dataset/obes.xls')

FileNotFoundError: [Errno 2] No such file or directory: 'dataset/obes.xls'

In [24]:
data.sheet_names

NameError: name 'data' is not defined

In [25]:
data_age = data.parse(u'7.2', skiprows=4, skipfooter=14)

NameError: name 'data' is not defined

In [26]:
data_age.head()

NameError: name 'data_age' is not defined

In [27]:
data_age.rename(columns={'Unnamed: 0': 'Year'}, inplace=True)

NameError: name 'data_age' is not defined

In [28]:
data_age.head()

NameError: name 'data_age' is not defined

In [29]:
data_age.dropna(inplace=True)

NameError: name 'data_age' is not defined

In [30]:
data_age.head()

NameError: name 'data_age' is not defined

In [31]:
data_age.set_index('Year', inplace=True)

NameError: name 'data_age' is not defined

In [32]:
data_age.head()

NameError: name 'data_age' is not defined

In [33]:
data_age.plot()

NameError: name 'data_age' is not defined

In [34]:
data_age_minus_total = data_age.drop('Total', axis=1)

NameError: name 'data_age' is not defined

In [35]:
data_age_minus_total.plot()

NameError: name 'data_age_minus_total' is not defined

In [36]:
data_age['Under 16'].plot(label='Under 16', legend=True)
data_age['35-44'].plot(label='35-44', legend=True)

NameError: name 'data_age' is not defined

## Time Series

In [35]:
from datetime import datetime

In [36]:
date_rng = pd.date_range(start='1/01/2020', end='1/08/2020', freq='H')

In [37]:
date_rng

DatetimeIndex(['2020-01-01 00:00:00', '2020-01-01 01:00:00',
               '2020-01-01 02:00:00', '2020-01-01 03:00:00',
               '2020-01-01 04:00:00', '2020-01-01 05:00:00',
               '2020-01-01 06:00:00', '2020-01-01 07:00:00',
               '2020-01-01 08:00:00', '2020-01-01 09:00:00',
               ...
               '2020-01-07 15:00:00', '2020-01-07 16:00:00',
               '2020-01-07 17:00:00', '2020-01-07 18:00:00',
               '2020-01-07 19:00:00', '2020-01-07 20:00:00',
               '2020-01-07 21:00:00', '2020-01-07 22:00:00',
               '2020-01-07 23:00:00', '2020-01-08 00:00:00'],
              dtype='datetime64[ns]', length=169, freq='H')

In [38]:
df = pd.DataFrame(date_rng, columns=['date'])

In [39]:
df.head()

                 date
0 2020-01-01 00:00:00
1 2020-01-01 01:00:00
2 2020-01-01 02:00:00
3 2020-01-01 03:00:00
4 2020-01-01 04:00:00

In [40]:
df['data'] = np.random.randint(0, 100, size=(len(date_rng)))

In [41]:
df.head()

                 date  data
0 2020-01-01 00:00:00    64
1 2020-01-01 01:00:00    92
2 2020-01-01 02:00:00    41
3 2020-01-01 03:00:00    51
4 2020-01-01 04:00:00     9

In [42]:
df.set_index('date', inplace=True)

In [43]:
df.head()

                     data
date
2020-01-01 00:00:00    64
2020-01-01 01:00:00    92
2020-01-01 02:00:00    41
2020-01-01 03:00:00    51
2020-01-01 04:00:00     9

In [44]:
df[
    df.index.day == 2
]

                     data
date
2020-01-02 00:00:00    56
2020-01-02 01:00:00    67
2020-01-02 02:00:00     4
2020-01-02 03:00:00    86
2020-01-02 04:00:00    39
2020-01-02 05:00:00    22
2020-01-02 06:00:00    69
2020-01-02 07:00:00    21
2020-01-02 08:00:00    44
2020-01-02 09:00:00    37
2020-01-02 10:00:00    77
2020-01-02 11:00:00    45
2020-01-02 12:00:00    70
2020-01-02 13:00:00     5
2020-01-02 14:00:00    15
2020-01-02 15:00:00    95
2020-01-02 16:00:00     1
2020-01-02 17:00:00    29
2020-01-02 18:00:00    46
2020-01-02 19:00:00    25
2020-01-02 20:00:00     9
2020-01-02 21:00:00    28
2020-01-02 22:00:00    86
2020-01-02 23:00:00    26

In [45]:
df['2020-01-03']

                     data
date
2020-01-03 00:00:00    20
2020-01-03 01:00:00    37
2020-01-03 02:00:00     9
2020-01-03 03:00:00     3
2020-01-03 04:00:00    25
2020-01-03 05:00:00    98
2020-01-03 06:00:00    54
2020-01-03 07:00:00    55
2020-01-03 08:00:00     3
2020-01-03 09:00:00    32
2020-01-03 10:00:00    94
2020-01-03 11:00:00    19
2020-01-03 12:00:00    72
2020-01-03 13:00:00    29
2020-01-03 14:00:00    97
2020-01-03 15:00:00    93
2020-01-03 16:00:00    53
2020-01-03 17:00:00    66
2020-01-03 18:00:00    18
2020-01-03 19:00:00    74
2020-01-03 20:00:00    48
2020-01-03 21:00:00     7
2020-01-03 22:00:00    18
2020-01-03 23:00:00     4

In [46]:
df['2020-01-04':'2020-01-06']

                     data
date
2020-01-04 00:00:00    91
2020-01-04 01:00:00     5
2020-01-04 02:00:00    30
2020-01-04 03:00:00    58
2020-01-04 04:00:00    45
...                   ...
2020-01-06 19:00:00    91
2020-01-06 20:00:00     0
2020-01-06 21:00:00    27
2020-01-06 22:00:00    43
2020-01-06 23:00:00    47

[72 rows x 1 columns]

In [47]:
df.resample('D').mean()

                 data
date
2020-01-01  53.875000
2020-01-02  41.750000
2020-01-03  42.833333
2020-01-04  58.291667
2020-01-05  52.000000
2020-01-06  53.791667
2020-01-07  51.000000
2020-01-08  72.000000

In [48]:
df.rolling(3).sum()

                      data
date
2020-01-01 00:00:00    NaN
2020-01-01 01:00:00    NaN
2020-01-01 02:00:00  197.0
2020-01-01 03:00:00  184.0
2020-01-01 04:00:00  101.0
...                    ...
2020-01-07 20:00:00  171.0
2020-01-07 21:00:00  165.0
2020-01-07 22:00:00  201.0
2020-01-07 23:00:00  224.0
2020-01-08 00:00:00  238.0

[169 rows x 1 columns]

In [49]:
opsd_daily = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/opsd_germany_daily.csv')

In [50]:
opsd_daily.head()

         Date  Consumption  Wind  Solar  Wind+Solar
0  2006-01-01     1069.184   NaN    NaN         NaN
1  2006-01-02     1380.521   NaN    NaN         NaN
2  2006-01-03     1442.533   NaN    NaN         NaN
3  2006-01-04     1457.217   NaN    NaN         NaN
4  2006-01-05     1477.131   NaN    NaN         NaN

In [51]:
opsd_daily.set_index('Date', inplace=True)

In [52]:
opsd_daily.head()

            Consumption  Wind  Solar  Wind+Solar
Date
2006-01-01     1069.184   NaN    NaN         NaN
2006-01-02     1380.521   NaN    NaN         NaN
2006-01-03     1442.533   NaN    NaN         NaN
2006-01-04     1457.217   NaN    NaN         NaN
2006-01-05     1477.131   NaN    NaN         NaN

In [53]:
opsd_daily.index

Index(['2006-01-01', '2006-01-02', '2006-01-03', '2006-01-04', '2006-01-05',
       '2006-01-06', '2006-01-07', '2006-01-08', '2006-01-09', '2006-01-10',
       ...
       '2017-12-22', '2017-12-23', '2017-12-24', '2017-12-25', '2017-12-26',
       '2017-12-27', '2017-12-28', '2017-12-29', '2017-12-30', '2017-12-31'],
      dtype='object', name='Date', length=4383)

In [54]:
opsd_daily = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/opsd_germany_daily.csv',
                         index_col=0,
                         parse_dates=True)

In [55]:
opsd_daily.head()

            Consumption  Wind  Solar  Wind+Solar
Date
2006-01-01     1069.184   NaN    NaN         NaN
2006-01-02     1380.521   NaN    NaN         NaN
2006-01-03     1442.533   NaN    NaN         NaN
2006-01-04     1457.217   NaN    NaN         NaN
2006-01-05     1477.131   NaN    NaN         NaN

In [56]:
opsd_daily['Year'] = opsd_daily.index.year
opsd_daily['Month'] = opsd_daily.index.month
opsd_daily['Weekday'] = opsd_daily.index.weekday

In [57]:
opsd_daily.head()

            Consumption  Wind  Solar  Wind+Solar  Year  Month  Weekday
Date
2006-01-01     1069.184   NaN    NaN         NaN  2006      1        6
2006-01-02     1380.521   NaN    NaN         NaN  2006      1        0
2006-01-03     1442.533   NaN    NaN         NaN  2006      1        1
2006-01-04     1457.217   NaN    NaN         NaN  2006      1        2
2006-01-05     1477.131   NaN    NaN         NaN  2006      1        3

In [2]:
opsd_daily['Consumption']

NameError: name 'opsd_daily' is not defined

In [1]:
opsd_daily['Consumption'].plot(linewidth=0.5)

NameError: name 'opsd_daily' is not defined